Задача: Организация работы парковки

Используемые сущности:

Parking, Ticket, Car

Описание работы с сущностями:

Parking - парковка. Имеет ограниченное количество мест; ticket - билет, въезжающая машина получает билет с уникальным идентификатором (тип int); car - машина, имеет уникальный номер (String).

Постановка задачи:

Часть 1.

Необходимо разработать консольное приложение парковки. Должна быть возможность задать количество машиномест. Въезд и выезд каждой машины должен быть реализован в отдельном потоке. При въезде на парковку выдается парковочный билет. Парковка не должна переполняться. При выезде, билет забирается. Билет может быть использован повторно. На заезд машине требуется от 1 до 5 секунд, задается настройками.

Команды:

p:N - (park) чтобы припарковать машину, в командной строке вводится, где N - количество машин на въезд

u:N - (unpark) чтобы выехать с парковки. N - номер парковочного билета

u:[1..n] - (unpark) чтобы выехать с парковки нескольким машинам, где в квадратных скобках, через запятую передаются номера парковочных билетов

l - (list) список машин, находящихся на парковке. Для каждой машины выводится ее порядковый номер и номер билета

c - (count) количество оставшихся мест на парковке

e - (exit) выход из приложения

Часть 2. Дополнительное условие

Одновременно въезжать и выезжать могут не более 2 машин за раз. Оставшиеся машины ожидают в очереди.
